fio_test/test_smallfiles_randrw_extfuse
smallfiles_randrw_extfuse: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 4 processes

smallfiles_randrw_extfuse: (groupid=0, jobs=4): err= 0: pid=7026: Sun Jun 22 19:32:35 2025
  read: IOPS=7029, BW=27.5MiB/s (28.8MB/s)(824MiB/30001msec)
    slat (usec): min=6, max=28713, avg=306.36, stdev=398.34
    clat (usec): min=413, max=48165, avg=12320.48, stdev=2747.91
     lat (usec): min=974, max=48183, avg=12627.32, stdev=2794.97
    clat percentiles (usec):
     |  1.00th=[ 7570],  5.00th=[ 8717], 10.00th=[ 9372], 20.00th=[10159],
     | 30.00th=[10814], 40.00th=[11338], 50.00th=[11994], 60.00th=[12518],
     | 70.00th=[13304], 80.00th=[14091], 90.00th=[15664], 95.00th=[17171],
     | 99.00th=[21103], 99.50th=[22938], 99.90th=[27657], 99.95th=[35390],
     | 99.99th=[43254]
   bw (  KiB/s): min=21960, max=31512, per=100.00%, avg=28123.12, stdev=445.73, samples=236
   iops        : min= 5490, max= 7878, avg=7030.56, stdev=111.47, samples=236
  write: IOPS=3024, BW=11.8MiB/s (12.4MB/s)(354MiB/30001msec); 0 zone resets
    slat (usec): min=21, max=30721, avg=588.04, stdev=503.14
    clat (usec): min=742, max=48384, avg=12363.97, stdev=2726.41
     lat (usec): min=867, max=48447, avg=12952.65, stdev=2806.86
    clat percentiles (usec):
     |  1.00th=[ 7635],  5.00th=[ 8717], 10.00th=[ 9372], 20.00th=[10159],
     | 30.00th=[10814], 40.00th=[11469], 50.00th=[11994], 60.00th=[12649],
     | 70.00th=[13304], 80.00th=[14222], 90.00th=[15664], 95.00th=[17171],
     | 99.00th=[20841], 99.50th=[22676], 99.90th=[27132], 99.95th=[32375],
     | 99.99th=[44827]
   bw (  KiB/s): min= 9464, max=13664, per=100.00%, avg=12100.19, stdev=203.78, samples=236
   iops        : min= 2366, max= 3416, avg=3024.85, stdev=50.96, samples=236
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=17.56%, 20=80.92%, 50=1.51%
  cpu          : usr=1.87%, sys=15.51%, ctx=307345, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=210887,90734,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=27.5MiB/s (28.8MB/s), 27.5MiB/s-27.5MiB/s (28.8MB/s-28.8MB/s), io=824MiB (864MB), run=30001-30001msec
  WRITE: bw=11.8MiB/s (12.4MB/s), 11.8MiB/s-11.8MiB/s (12.4MB/s-12.4MB/s), io=354MiB (372MB), run=30001-30001msec