fio_test/test_smallfiles_randrw_fuse
smallfiles_randrw_fuse: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 4 processes
smallfiles_randrw_fuse: Laying out IO files (100 files / total 50MiB)
smallfiles_randrw_fuse: Laying out IO files (100 files / total 50MiB)
smallfiles_randrw_fuse: Laying out IO files (100 files / total 50MiB)
[...]

smallfiles_randrw_fuse: (groupid=0, jobs=4): err= 0: pid=34636: Sun Jun 22 17:27:49 2025
  read: IOPS=6608, BW=25.8MiB/s (27.1MB/s)(774MiB/30002msec)
    slat (usec): min=4, max=34470, avg=359.69, stdev=489.15
    clat (usec): min=758, max=66949, avg=13091.37, stdev=3945.20
     lat (usec): min=1272, max=68060, avg=13451.66, stdev=4033.62
    clat percentiles (usec):
     |  1.00th=[ 7832],  5.00th=[ 8979], 10.00th=[ 9634], 20.00th=[10421],
     | 30.00th=[11076], 40.00th=[11731], 50.00th=[12387], 60.00th=[13042],
     | 70.00th=[13829], 80.00th=[14877], 90.00th=[16909], 95.00th=[19792],
     | 99.00th=[28705], 99.50th=[32900], 99.90th=[45351], 99.95th=[51643],
     | 99.99th=[60031]
   bw (  KiB/s): min=11343, max=31744, per=100.00%, avg=26504.75, stdev=847.97, samples=236
   iops        : min= 2834, max= 7936, avg=6625.76, stdev=212.03, samples=236
  write: IOPS=2845, BW=11.1MiB/s (11.7MB/s)(333MiB/30002msec); 0 zone resets
    slat (usec): min=21, max=34086, avg=545.87, stdev=563.98
    clat (usec): min=1549, max=66248, avg=13160.60, stdev=3987.11
     lat (usec): min=2149, max=68853, avg=13707.20, stdev=4111.76
    clat percentiles (usec):
     |  1.00th=[ 7832],  5.00th=[ 8979], 10.00th=[ 9634], 20.00th=[10552],
     | 30.00th=[11207], 40.00th=[11731], 50.00th=[12387], 60.00th=[13042],
     | 70.00th=[13829], 80.00th=[15008], 90.00th=[17171], 95.00th=[19792],
     | 99.00th=[29230], 99.50th=[33424], 99.90th=[45876], 99.95th=[52167],
     | 99.99th=[59507]
   bw (  KiB/s): min= 4596, max=13529, per=100.00%, avg=11416.24, stdev=362.18, samples=236
   iops        : min= 1148, max= 3382, avg=2853.63, stdev=90.57, samples=236
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=14.24%, 20=80.97%, 50=4.73%
  lat (msec)   : 100=0.06%
  cpu          : usr=1.94%, sys=13.74%, ctx=333874, majf=0, minf=97
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=198257,85363,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=25.8MiB/s (27.1MB/s), 25.8MiB/s-25.8MiB/s (27.1MB/s-27.1MB/s), io=774MiB (812MB), run=30002-30002msec
  WRITE: bw=11.1MiB/s (11.7MB/s), 11.1MiB/s-11.1MiB/s (11.7MB/s-11.7MB/s), io=333MiB (350MB), run=30002-30002msec